

 

   Архитектурная задача на весь курс: ДЗ для продолжающих (Intermediate)

*** Intermediate ***

Написать программу (начальный прототип Морского Боя), которая будет:

1. Приветствовать игрока (выводя сообщения консоль).

2. Запрашивать его имя/ник

3. Содержать константы, которые в будущем могут пригодиться для игры (количество кораблей одного типа и другого и третьего, общее количество кораблей и т.д.)

4. Разработать отдельный класс для корабля, у которого есть поля класса специфичные для кораблей (тип корабля, координаты, если нужны)

5. Создать нужное для морского боя количество объектов-кораблей и вывести сообщение о том, что корабли созданы.

6. Вывести сообщение о победителе (пока в качестве заглушки можно использовать функцию для генерирования случайных чисел, или же выбирать всегда одного победителя, если пока не знаете, как случайные числа получать)

7. Помним о правилах по оформлению кода.

Второй шаг:

Программа должна вывести на экран в текстовом виде поле игрока и поле компьютера.

Примерно в таком виде:

А B C D ...

1 | | | | |

2 | | | | |

3 | | | | |


Доп. задание:

Написать метод (подумайте, кому он должен принадлежать, и кто его будет вызывать) по добавлению всех кораблей на поле случайным образом, даже если они пересекаются друг с другом.

Учтите план на будущее: возможно когда-то потом потребуется реализовать еще и метод по ручному добавлению кораблей (сам этот метод пока делать не нужно).

Серьезное усложнение: а теперь добавьте проверку на то, чтобы корабли не пересекались при добавлении на поле, то есть корабли не могут располагаться вплотную друг к другу.


Доп. задание

Реализуйте переключатель в программе, между автоматическим размещением кораблей и ручным. Автоматическая расстановка жизненно необходима для тестирования всей логики работы программы, ручная же расстановка является всего лишь дополнительной опцией.

Ручную расстановку лучше пока не делать, так как текстом это вводить очень долго в консоли, а в графическом интерфейсе придется все равно переделывать.

Реализуйте метод автоматической стрельбы: как для пользователя, так и для компьютера — ничего не запрашивает, просто стреляет, выводит результат и обновленное поле.

Метод ручной стрельбы тоже не имеет большого смысла делать в консольном варианте, лучше сразу в графическом. Но если хотите, попробуйте.

Задание со звездочкой: так как в дальнейшем планируется перенос игры с текстового движка на графический, поэтому постарайтесь разделить логику программы и визуальное отображение. В этом вам поможет знание интерфейсов и абстрактных классов.

Для этого создайте интерфейс (или абстрактный класс), который бы содержал в себе все методы вывода чего-либо вообще на экран.

В самой логике программы не должно остаться вызовов System.out.println() вообще. Вместо такого вывода вы должны вызывать соответствующие методы из экземпляра, реализующего этот интерфейс (абстрактный класс). Тем самым все классы, которые у вас отвечают за логику работы программы станут тем, что называется Моделью в паттерне Model-View-Controller. https://ru.wikipedia.org/wiki/Model-View-Controlle...

ДЗ делайте в IntelliJ IDEA.

Затем в проводнике (Windows) или в Finder (Mac) сделайте правый клик на папке проекта и выберите в меню что-то вроде "Архивировать проект" (точное название зависит от операционной системы и приложения для архивации).

Архив можете с помощью драг-н-дроп просто сбросить вашему преподавателю прямо здесь в чат.


------------------------------------------------------------



 

   Задача на игру Морской бой

*** Intermediate ***

Дописываем код в соответствии с заданием прошлого занятия.

Супер доп. задания (алгоритмические):

1. Напишите алгоритм, в котором компьютер стремится добивать корабль игрока, в случае, если ранил корабль игрока.

2. Прочитайте про метод расстановки кораблей Я. И. Перельмана.

http://ru.wikipedia.org/wiki/%CC%EE%F0%F1%EA%EE%E9...

http://habrahabr.ru/post/180995/

3.1. Попробуйте реализовать метод расстановки по Перельману

3.2. Попробуйте реализовать метод оптимальной стрельбы


----------------------------------------------------------

0. В программу морского боя (если вы делаете морской бой) или крестиков-ноликов (если вы делаете крестики-нолики) с GUI (графическим интерфейсом) добавьте отображение модели на экран. Чтобы ходы компьютера были видны на экране.

-----------------------------------------------------------

0. В программу крестиков-ноликов с GUI (графическим интерфейсом) добавьте реализацию через засыпание потока, чтобы не было излишнего потребления ресурсов вечным циклом while

--------------------------------------------------------

0. В программу крестиков-ноликов с GUI (графическим интерфейсом) добавьте реализацию игры по сети

========================================================================================================================

1 Хочу, чтобы в линейном морском бое было игровое поле размером 1 на 10,
для того, чтобы на нем в дальнейшем были расставлены корабли/корабль.
testField.testCheckFieldSize()

2 Хочу, чтобы в начале игры поле, которое будет видеть игрок, инициализировалось в знак "." (точка),
чтобы было видно, куда игрок уже стрелял, а куда нет.

3 Хочу, чтобы на поле располагался 1 однопалубный корабль, расположение которого не видно игроку,
чтобы отслеживать игровую динамику

4 Хочу, чтобы можно было ввести номер ячейки и программа сообщила бы результаты выстрела,
чтобы игрок мог скорректировать свою стратегию

5 Хочу, чтобы при попадании в корабль на поле отображался "х", при промахе "*",
чтобы игрок мог визуально увидеть результат своего хода и отличить промах от попадания

6 Хочу, чтобы появлялось сообщение: "потопили" или "промахнулись" при, соответственно,
потоплении корабля, промахе, чтобы игрок сразу видел результат своего хода,
если поле большое и визуально изменить его изменение сложно.

7 Хочу, чтобы ввод номера ячейки начинался с 1 до числа ячеек на поле, чтобы ввод был юзер-френдли, как привык человек.

8 Хочу, чтобы после потопления корабля игра заканчивалась, чтобы можно было посчитать кол-во ходов.

9 Хочу, чтобы играло 2 игрока компьютер и человек, чтобы устроить соревнование AI vs. Human beings

10 Хочу, чтобы компьютер бил автоматически, а игрок вручную,
чтобы живой игрок мог использовать свое серое вещество в игре

11 Хочу, чтобы было можно определить победителя, если корабль подбит, чтобы игра когда-нибудь все же закончилась.

12 Хочу чтобы компьютер рандомно стрелял по ячейке, по которой еще не стреляли,
чтобы не был слишком уж умный и оставил человеку шанс на выигрыш


